{
    "intro": {
        "name": "James Bridenthal",
        "blurb": "Innovative Full Stack Developer with 15 years of experience specializing in .NET Web APIs, modern UI frameworks, and Azure cloud solutions. Dedicated to delivering scalable, high-performance applications that solve complex business challenges. Passionate about continuous learning and selecting optimal technologies to exceed client expectations and drive business value.",
        "socials": [
            {
                "name": "Github",
                "link": "https://github.com/jbridenthal"
            },
            {
                "name": "LinkedIn",
                "link": "https://www.linkedin.com/in/jamesbridenthal?trk=profile-badge"
            }
        ]
    },
    "skills": [
        {
            "skill": "Backend Development: 15+ years with .NET Framework, .NET Core, C#, VB.NET, ASP.NET Web API, RESTful API design",
            "link": ""
        },
        {
            "skill": "Frontend Development: Angular, React, Blazor, Astro, HTML5, CSS3, JavaScript/TypeScript",
            "link": ""
        },
        {
            "skill": "Database Technologies: Microsoft SQL Server, CosmosDB, MySQL",
            "link": ""
        },
        {
            "skill": "Cloud Services: Azure App Services, Azure Functions, Azure DevOps, Azure API Management",
            "link": ""
        },
        {
            "skill": "Development Methodologies: Agile/Scrum, CI/CD, Test-Driven Development, SOLID principles",
            "link": ""
        },
        {
            "skill": "Microsoft Azure Fundamentals Certified",
            "link": "https://www.credly.com/badges/b120fafe-59dd-46f3-ab13-76147d67d2b4"
        },
        {
            "skill": "Microsoft AI Fundamentals Certified",
            "link": "https://www.credly.com/badges/ee14e881-5d71-4380-acae-513735404da1"
        }
    ],
    "workHistory": [
        {
            "title": "Senior Software Engineer V",
            "company": "MRI Software",
            "location": "Cleveland, OH (Remote)",
            "startDate": "August 2011",
            "endDate": "Present",
            "bullets": [
                "Architect, build, and integrate legacy affordable and public housing applications adhering them to government guidelines while interacting with government API's",
                "Work on a Scrum team consisting of developers, quality assurance, product owner and scrum master. Participate in daily stand ups meetings, grooming sessions and participate in retro meetings.",
                "Full stack development in an agile environment using Angular, Javascript, C# and other .Net technologies. Writing unit tests using nunit, moq, xunit and spectator.",
                "Mentor junior developers on best practices, processes and coding standards.",
                "Code review code changes to ensure code quality meets our coding standards and also aligns with proper business logic of the product",
                "Create and maintain CI/CD for our software in Azure DevOps.",
                "Develop an integration test suite using SpecFlow and nunit to run tests against functionality and workflows",
                "Maintain legacy application developed in Powerbuilder and SQL including dev ops for CI/CD",
                "Help create health check project using Playwright, C# and Azure technologies for storage and database to help ensure core product meets standards for quality product.",
                "Mentoring summer interns as they work on their project to present to directors at the end of their internship.",
                "Recently handed an legacy product with no documentation where all previous developers have left. I have had to identify all projects associated with product, setup for local development, build new CI/CD, and document the processes for the product for future development."
            ]
        }
    ],
    "credentials": [
        {
            "title": "CIW v5 Associate Web Development",
            "info": [
                {
                    "title": "2011",
                    "link": ""
                }
            ]
        },
        {
            "title": "AAS Computer Science",
            "info": [
                {
                    "title": "Ivy Tech Community College",
                    "link": ""
                },
                {
                    "title": "Marion, IN 2008 - 2011",
                    "link": ""
                }
            ]
        },
        {
            "title": "Microsoft AI Fundamentals",
            "info": [
                {
                    "title": "2022",
                    "link": ""
                },
                {
                    "title": "Credily.com Verification",
                    "link": "https://www.credly.com/badges/ee14e881-5d71-4380-acae-513735404da1/public_url"
                }
            ]
        },
        {
            "title": "Microsoft Azure Fundamentals",
            "info": [
                {
                    "title": "2023",
                    "link": ""
                },
                {
                    "title": "Credily.com Verification",
                    "link": "https://www.credly.com/badges/b120fafe-59dd-46f3-ab13-76147d67d2b4/public_url"
                }
            ]
        }
    ]
}
